{"feed":[{"id":"171","name":"AIBEA this day 21st April","image":"null","status":"1946 - AIBEA Foundation Conference: Constitution adopted. K C Neogy and Ramesh Chakraborti elected President and General Secretary. 2010 - UFBU meets FM on Pension Option issue. 1980 - 3rd Bipartite Residual issues settled.","profilePic":"http://aibea.in/upload/mdnews/aibea.png","timeStamp":"1461228490000","url":""},{"id":"170","name":"AIBEAs Birth Day today","image":"null","status":"1935 - Com. R D Trivedi, former Vice President, AIBEA (date of birth). 1946 - Foundation Day of AIBEA. 1953 - Sastri Award published. 1960 - XI Conference of AIBEA. Com. Tarakeswar Chakraborti elected as Assistant Secretary for the first time at Hyderabad. Roshan Ali Khan, Mayor of Hyderabad inaugurates. 1971 - Massive AIBEA Silver Jubilee celebrations. Veterans and several Ministers participate. AIBEA Flag adopted. 1987 - Prabhat Parvana Trade Union Training Institute inaugurated at Madras.","profilePic":"http://aibea.in/upload/mdnews/aibea.png","timeStamp":"1461116366000","url":""},{"id":"169","name":"AIBEA this day 19th April","image":"null","status":"1997 - Second Biennial Conference of All India Bank Retirees’ Federation, Calcutta. Com. Romesh Chakraborti elected President.","profilePic":"http://aibea.in/upload/mdnews/aibea.png","timeStamp":"1461045876000","url":""},{"id":"168","name":"AIBEA this day 18th April","image":"null","status":"1940 - Com. Eknath Pai, Former Asst. Secretary, AIBEA (date of birth). 1975 - Tragic and unbearable loss to our movement. Com. H &nbsp;L Parvana, Secretary, AIBEA passes away at the age of 52 at New Delhi. AIBEA lost its precious jewel.","profilePic":"http://aibea.in/upload/mdnews/Parvana.png","timeStamp":"1460974949000","url":""},{"id":"167","name":"AIBEA this day 17th April","image":"null","status":"1931 - Com. Rajendra Syal, former Treasurer, AIBEA (date of birth) 85th Birth Anniversaru today. 1951 - Commencement of 49 days’ strike in Punjab National Bank against wage cuts etc. Com. H L Parvana, P L Syal, P R Bhatia, D P Chadha and 150 comrades dismissed. 1963 - Observance of All India Bank Nationalisation Day. 1970 - Massive demonstration at Bombay to back up 2nd Bipartite Demands before IBA.","profilePic":"http://aibea.in/upload/mdnews/aibea.png","timeStamp":"1460974296000","url":""}]}