{
    "feed": [
   
   {
            "id": 7,
            "name": "MINUTES OF INFORMAL MEETING OF OFFICE BEARERS MEETING AT DELHI",
            "image": null,
            "status": "Alongside the meeting of General Council of AIBEA, a meeting of available office-bearers of our Federation and leaders of our units was held at Delhi on the night on 25th April 2016.In the meeting both the President and General Secretary placed certain details on the under mentioned matters.
1.	Management's unilateral decision in slashing down the Clerical Recruitment from original indent of 2500 to 1410 and 1300 direct recruitment of officers to 700.
2.	Speculation about restructuring of Administrative offices - Reduction in circle offices and Zonal offices,
3.	Health of the Bank vis-a-vis the speculation about merger of Banks,
4.	Lackluster approach of the Management with regard to some commitments and issues pertaining to our ranks,
5.	Industrial Relations In Indore and Guwahati zones,
6.	Substaff promotions,
7.	Pending issues 
8.	Membership drive upon incoming recruitment of Clerical staff 
9.	Ensuing 15th triennial conference of AIUCBEF 
10.	Organisation 
",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1462237276000",
            "url": null
        }, 
        
        {
            "id": 6,
            "name": "MINUTES OF INFORMAL MEETING OF OFFICE BEARERS MEETING AT DELHI",
            "image": null,
            "status": "Prior to the discussions, President placed details about the MOBILE APPLICATION developed with the help of COM.Jai Krishnan, young office-bearer of  TAMILNADU unit and formally launched the application  in the meeting. The meeting appreciated the efforts of Federation and contribution of TAMILNADU unit and felt that this venture would go a long way in increasing the visibility of AIUCBEF, particularly among the younger generation. It was resolved to make use of this venture towards strengthening our units and Federation. Meeting placed on record its deep appreciation to COM. Jai Krishnan who has been instrumental in developing this application and thanked him for his continued interest. It was decided to formally make the application available to all after making corrections and updating.The meeting after discussing thread bare on the above mentioned issues took following decisions.
1.	To organize protest programmes  on the issue of manpower either jointly with all the unions or by two majority unions (workman AIUCBEF officers AIUCBOF) or alone
2.	To convey our views on the proposal if any on  restructure of administrative offices
3.	To convey our displeasure and anguish to the top management on their failure to honour certain commitments on various pending issues
4.	To convey our views and demand discussions on the Health of our Bank
5.	To gear up the units for reaching out the new recruits 
6.	To take all steps for effective use of the New venture - Mobile application of AIUCBEF both to the benefit of members and organisation
7.	To take a final decision on 15th triennial conference related matters in the ensuing WC meeting at Jaipur in the first week of July
8.	To intensify the efforts for immediate declaration of substaff promotions under the existing policy
9.	To take further steps towards restoring order in Indore and Guwahati zones
Next day, on 26th, President and General Secretary along with President Delhi unit COM.Rajesh Sharma, held discussions with the general Secretary of Officers Federation who was incidentally at Delhi. Sharing our concern, COM.Somen Roy CHOWDHRY agreed with the decisions of our office-bearers meeting. It has been decided that further discussions to be held at Kolkata on 13TH May between the President and General Secretaries of both the Organisation to chalk out the programme for implementation jointly by the ranks of both the organisations.All our units are advised to be in readiness to respond to the call which will be scheduled after the impending elections in some states.",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1462237276000",
            "url": null
        },
        
        {
            "id": 5,
            "name": "3rd Triennial conference of our Chhattisgarh unit",
            "image": "http://aiucbef.com/appnews/images/newchatunit.jpg",
            "status": "Our Chhattisgarh unit's conference was held on 24th April.  Conference was participated by more than 150  enthusiastic comrades of the unit besides executives, officers and other Bank unions leaders. High light of the conference was participation of a large number of young employees both men and women from far off districts /branches. More so, most part of the conference was organised by the young comrades. In the conference, large number young comrades were elected as office bearers and committee members, besides reelection of COM. Ashok Nagrale as President and COM.Shiresh Nalgundwar as General Secretary. Kudos to the unit and best wishes to the new team.",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1461569403000",
            "url": null
        },
   
    {
            "id": 4,
            "name": "STATE LEVEL WOMEN EMPLOYEES CONVENTION AT LUCKNOW",
            "image": null,
            "status": "Our UP unit has taken steps to organize Woman employees convention in 22ND May at Lucknow. COM.B.VIJAYAL our joint Secretary along with the President will be attending the convention which is expected to be participated by around 75 woman comrades of our UP unit. Federation wishes the convention all success.",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1462237276000",
            "url": null
        },
    
{
            "id": 3,
            "name": "AIUCBEF",
            "image": null,
            "status": "Today is the 13th death anniversary of our great leader Com Tarakeswar Chakroborty We pledge on this day to carry forward his vision of larger unity among bank employees - with more conviction to strengthen the organisation at all levels to fulfil his vision & mission, Com Tarakda Amar Rahe",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1462152059000",
            "url": null
        },

        
        
    ]
}