{
    "feed": [
{
            "id": 6,
            "name": "Human chain before HO and ZO started today",
            "image": "https://aiucbef.com/appnews/images/humanchain.jpg",
            "status": " " ,
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1537161764000" ,
            "url": null
        },
      {
                  "id": 6,
                  "name": "DECISIONS OF WORKING COMMITTEE MEETING - ACTION PROGRAMMES",
                  "image": "https://aiucbef.com/appnews/images/informalcv.jpg",
                  "status": "We trust that our earlier circular dated 25th August is received by our units and units have taken necessary steps to communicate the same to our rank and file to prepare them. We now give under the details for immediate compliance of our units. 
1. OBSERVANCE OF PROTEST & DEMANDS DAY WITH BADGE WEARING BY ALL OUR MEMBERS. ON MONDAY THE 10 TH SEPTEMBER. 
Note : Units will print the badge as above and ensure despatch to branch units, so as to reach branch units before 8 th September. 
2. OBSERVE HUMAN CHAIN BEFORE ZONAL OFFICES WHERE UNITS ARE IN A POSITION TO MOBILISE MINIMUM 10 MEMBERS TO STAND BEFORE THE ENTRANCE OF ZONAL OFFICE IN A ROW OR TWO HOLDING PLAN CARDS BETWEEN 9.15 AM AND 9.50 AM ON MONDAY THE 17 TH SEPTEMBER. 
Slogans for Placards will be sent shortly.The same day evening AT 5.30 PM, there can be DEMONSTRATION before all Zonal offices. - SLOGANS WILL BE SENT SHORTLY 
3. PREPARE THE UNIT FOR DHARNA PROGRAMME ON 24 TH SEPTEMBER. DHARNA WILL BE HELD BEFORE NODAL ZONAL OFFICES. OFFICE-BEARERS, COMMITTEE MEMBERS OTHER INTERESTED ACTIVISTS WILL FORM PART OF THE DHARNA. TIMING : 9.30 AM to 5 pm which will be followed by Demonstration by mobilising local members. Units are advised to issue proper communication to their branch units and ensure all members are made aware of the programmes. 
We remain confident that this time too our units and members would make the struggle to set yet another milestone in our journey." ,
                  "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
                  "timeStamp": "1535421229000" ,
                  "url": null
              },

{
            "id": 6,
            "name": "Rededication week Dec 18-22 Starts today",
            "image": "https://aiucbef.com/appnews/images/reded.jpg",
            "status": "UFUBU REDEDICATION WEEK 18 to 22  Dec.2017
Campaign begins to day
Canvass CASA Accounts
Retail Loan Products
Recover NPAs
Let us prove that UFUBU can
DO IT" ,
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1513568451000" ,
            "url": null
        },
        {
            "id": 6,
            "name": "15th Triennial Conference of our Federation - Citcular",
            "image": null ,
            "status": "15th Triennial Conference of our Federation, held at Hyderabad on 10 th,11th and 12th September,2017 was a grand Success.
Highlights of the conference:
• Attended by 900 comrades from all over India ,
•Around 100 woman comrades among them, 
•Around 450 comrades from the younger generation,
•Inauguration by General Secretary of Communist Party of India,
•Addressed by Managing Director and CEO of our Bank,
•Keynote address by General Secretary of AIBEA,
•Greeted by Executive Director of our Bank
•Special session for Youth,
•Special session on Medical Insurance Scheme by HeritageHealth TPA,
•56 comrades participated in Deliberations 
•All sessions dot on Time, 
•Praise worthy arrangements by Hostunit
Inaugural & Public Session of the Conference commenced with hoisting of AIBEA flag dot at 3.30pm on10th by Com.C.H.Venkatachalam, GeneralSecretary of AIBEA amidst thunderous slogans of AIBEA ZINDABAD, AIUCBEF ZINDABAD renting the air.
Sharpat4.05PM thesessionbeganwithawelcomeSongandlightingoflamp. Com.Rambabu,ChairmanoftheReceptionCommiteewelcomedthegathering.
Com.K.VijhayanPresidentofAIUCBEFthendeliveredhisspeechexplainingthesituationin whichthe15THTriennialconferenceismeeting.
Com.S.SudhakarReddy,GeneralSecretaryofCPI,inhisinspiringInauguralAddressspoke atlengthontheglobalsituationthathadimpactonIndiaanditspeople,Hewascriticalof thepoliciesbeingpursuedbytheGovernmentatthecentreagainstthecommonpeopleand workingclass.Condemningthepoliciesthatareaimedat,todestroythePublicSector institutions,hecomplimentedthe
Bank em ployees under the banner of AIBEA, for their relentless struggle against privatizationofPublicsectorbanks.HeexpressedconfidencethatAIUCBEFwill continuetobeintheforefrontofalstrugglescaledbyAIBEAandthejointforum ofCentral TradeUnions.
Shri.R.K.Takkar,MD&CEOofourBank,theChiefGuestintheConference,whilethanking ourFederationforgivingthisopportunitytospeaktosuchavastgathering,explainedthe chalengesbeforetheBankanditsworkforce,inthebackgroundofinvocationofPCAand signingofMOU.WhilesoundingaoptimisticnoteonrevivalofBank‘shealth,heassured thatthereisnothreatofMergerandevenifitbecomesinevitablewewouldmakeourBank aACQUIRINGBankamidstthunderousapplausefrom theparticipants.
Com.C.H.Venkatachalam inhisusualinimitablestylespokeatlengthastohow thebulging NonPerformingAssetsandthelackofinadequatestepsfrom theGovernmentforrecovery h a v e a m e n a c in g e f fe c t o n th e B a n k ’s b a la n c e s h e e ts . D e m a n d in g o f th e G o v e rn m e n t stringentstepstorecoverpeople’smoneyfrom thecorporatedefaulters,hewarnedthat stepstowardsconsolidationwouldfurthercompoundtheproblemsoftheBanks.Speaking on11thbipartitewagetalks,heexpressedconfidencethatthenegotiatingteam ofIBA, beingheadedbynoneotherthanShri.R.K.Takkar,MD&CEOofUCOBankwouldadopta fairandreasonableapproachandariveatasatisfactorysetlementbeforetheexpiryofthe curentsetlement.HecomplimentedAIUCBEFforitsroleinchampioningthecauseofUCO comradesandinalthestrugglescaledbyAIBEAandUFBU.
Com.AjayRouterey,GeneralSecretaryofAlIndiaFederationofUCOBankOficers(AIBOA) greetedthemembersandurgedupontheFederationtotakemorestepstostrengthen AIFUBO.
Shri.D.Sharma,ZonalHeadofHyderabadZonegreetedtheconference.
Aspartofourinvolvementinthesocialcauseandtomarktheoccasionof15thTriennial Conference,anamountof21,000wasdonatedto HOMEOFDISABLEDaNGOtakingcare ofnearly400physicalyandmentalychalengedpeople.Thechequewasdeliveredtothe authoritiesbyCom.C.H.V.&ourMD.
Com.C.M.Patel,GeneralSecretaryofourFederationdeliveredvoteofthanks.
Folowed by this,a culturalentertainmentprogramme show cased to entertain the participants.BharataNatyam danceperformedbydaughtersofourcomradeswasthe highlightoftheprogramme.
ThustheGrandInauguralSessioncametoanendat9.30pm asscheduled.
Thekindofdiscipline,thekindofcooperation,thekindofatentiveness,displayedbyour comradesdeservesalpraise.
",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1505268545000",
            "url": null
        },


{
            "id": 32,
            "name": "Our Action Programs",
            "image": null,
            "status": "A meeting of our office bearers, WC members, functionaries of units , who were present in Chennai in connection with 28th  NATIONAL CONFERENCE OF AIBEA was held on 10th January. Both the President and the General Secretary placed before the members, developments concerning the bank and pending issues. The meeting took stock of the situation arising out of under mentioned programmes carried out by the units at the call of Federation.

Signature campaign - letter sent to MD and consequent response from the management.
Submission of letters to branch managers demanding payment of over time for the actual hours of work performed during the period of Demonetisation.
It was observed that on the issue of OVER TIME some of the units have not organised it as called upon by the Federation. ALL UNITS SHOULD ENSURE COMPLETION OF THE PROGRAMME - THAT IS SUBMISSION OF INDIVIDUAL LETTER IN THE FORMAT GIVEN BY FEDERATION POSITIVELY BEFORE 25 th JANUARY.

Further, it was noted that after our signature campaign ....
Management came forward to implement staff welfare measures,
A committee was formed to screen VRS requests and some among them are considered, though it is not to our satisfaction
Compassionate appointments  are yet to be considered
Management remains silent on Over time issue
Similarly no response to our demand for holding policy committee meeting to discuss certain important pending policy matters,
Unfriendly Attitude of HRM department towards various matters raised by us,
Non implementation of understandings reached in various meetings between the management and the Federation.

As part of our ongoing movement against the above said attitude of the Management, it has been decided to unleash the following programmes.

Units which are yet to organise SUBMISSION OF INDIVIDUAL LETTER DEMANDING OVER TIME TO BRANCH HEADS IN THE PRESCRIBED FORMAT SHOULD COMPLETE THE SAME AND CONFIRM COMPLIANCE BY 25 th January.
Office bearers and Committee members stationed in the location of circle offices shall meet the circle heads in a deputation and submit a memorandum ( specimen encoded) on our demands,  seeking his support by talking up with HO HRM. This will be carried out on a uniform date - 31/1/2017
Dharna before all Zonal offices on dates as prescribed in the enclosure.
DHARNA BEFORE HEAD OFFICE FIRST WEEK OF MARCH ( date will be decided after confirming working committee arrangements with Uco Bank Staff union, Kolkata)
Working committee will meet a day after Dharna at Kolkata and decide further programmes and the date for All India strike.
6.  No member shall accept to work over time unless it is requested in writing by the branch manager on and from 1st February 2017 . Units shall give a letter to this effect to respective zonal heads on 30 th January.

In the mean while we have addressed a letter to GM HRM about our views and suggestions on the HEALTH OF THE BANK WHICH MAY BE CIRCULATED WIDELY AMONG ALL THE BRANCHES & STAFF

Comrades, we have no option except to go all out to make our existence meaningful. Management  is increasingly becoming casual towards unions and the interest of work force. Our concern for the bank too is responded in a less than serious manner. We have to do justice as a responsible trader union. Let us, mindless of the cost and consequences, march ahead to do that. Go ahead with courage, conviction, commitment and confidence.

Implement all programmes in letter and spirit. Inform Federation from time to time about the success of your efforts in implementing the programmes in total. ",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1480731951000",
            "url": null
        },
{
            "id": 32,
            "name": "NEWS UPDATE",
            "image": null,
            "status": "AIUCBEF  launches mass signature compaign from employees to MD both on the steps needed for Improving Bank's performance and on Attitude of Top Management towards the matters pertaining to work force.",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1480731951000",
            "url": null
        },

{
            "id": 34,
            "name": "NEWS UPDATE:STAFF WELFARE MEETING ON 19TH OCTOBER",
            "image": null,
            "status": "Members are aware that consequent to our me memorandum to Managing Director followed by other demonstrative programmes, Management in a meeting held last month assured to call for the Staff welfare committee meeting for finalising / renewing the staff welfare measures.Much delayed Staff welfare meeting was held on 19TH Oct. 2016 at our Head Office. Undersigned participated in the said meeting on behalf of our Federation. From Management side both the EDs, GM HRM, GM Finance, DGM PSD, AGM PSD, and their team participated in the meeting.Meeting started with a brief welcome address by GM HRM. While replying from the unions side we expressed our deep resentment over undue delay in conveying this meeting.However we also thanked the management for providing Rs. 10 crores towards staff welfare scheme in spite of the fact that Bank has incurred loss for the relevant financial year.Apportionment of fund of 10 crores (last years allotment was 20 crores) was taken up for discussion for the existing and retired employees.From our union’s side we have tried successfully to continue all the Welfare schemes except the one which have become irrelevant-cost of books for Part-time employees, as there are no part-time employees in the Bank now.Moreover we have some unspent amount of staff welfare fund too. We have pleaded to the Management to rope in that fund too while apportioning the actual provisional amount in various staff welfare schemes.HOWEVER THE FINAL CALL IN THIS MATTER HAS TO BE TAKEN BY M. D. & CEO. SINCE M.D. & CEO WAS IN THE MEETING (AS HE WAS OUT OF STATION) CONCLUSIVE DECISION COULD NOT BE TAKEN.I am sure that comrades will appreciate that the total fund available is half of the previous year, in spite of the fact that our Bank incurred huge loss. Let me refresh your memory that the lead to make at least some provision for staff welfare scheme was taken by us, despite red Balance sheet. Moreover, just like in previous years, mandatorily, apportionment has to be made for retired employees too.We are confident that we will be able to continue with all the schemes as mentioned above with a marginal reduction on one/two schemes.Retired employees will be provided with some subsidy which will be comparable considering the financial resource of staff welfare fund and the bank for their health insurance scheme besides their scheme of Funeral expenses.We have also pleaded emphatically with the Management to provide soft loan for subscribing to Health Insurance scheme, in light of steep hike in premium. Management too agreed for the same.We are unable to quantify the exact amount, unless the decision regarding unspent amount is taken. Rest assured we trying our best, and in case of favorable decision regarding roping in of unspent amount is forthcoming, the reduction in the scheme will a very small one besides retired employees getting reasonable subsidy for health insurance. As,in the absence of MD and his approval, we have thought it fit to hold back the communication though some other unions have circulated  the details of deliberations of the meeting. Hope our comrade will appreciate.",
            "profilePic": "http://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1476927673000",
            "url": null
        }




    ]
}
