{
    "feed": [
        {
            "id": 34,
            "name": "WORKING COMMITEE MEETING COMMENCES AT PUNE ON 23RD FEBRUARY 2019",
            "image": "https://aiucbef.com/appnews/images/workcompune.jpeg",
            "status": "WORKING COMMITEE MEETING COMMENCES AT PUNE ON 23RD FEBRUARY 2019",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1476927673000",
            "url": null
        }
        {
            "id": 32,
            "name": "Letter to GM HRM Regarding Non Response to OUR letters and issues raised.",
            "image": null,
            "status": "We trust that the under mentioned letters sent by us to you have been placed before you.
HO/ HRM/GM/36/2017-20 DT 28/11/2018. REGARDING ISSUES DEALT IN THE GR
MEETING AND POLICY COMMITTEE MEETING
HO/HRM/GM/37/2017-20 DT 19/12/2018 REGARDING BIOMETRIC ATTENDANCE AND
CONSEQUENTIAL PROBLEMS.
HO/ HRM/ GM/ 38/2017-20. DT 02/01/2109. REGARDING IR SITUATION IN JAIPUR
We hope that the above letters have received your needed attention.
We are however disappointed to observe that neither there is acknowledgement of
having received our communications nor visible and needed steps appear to have been
taken on the issues raised through the letters.
We will not be misunderstood for our understanding of the attitude, approach and
functioning of the department. We are reminded that way back in 2006/07 when there
was a move on restructuring the departments, we were impressed upon about the need
for redefining the role of the then Personnel Department by bifurcating it into Personnel
Services Department and Human Resources Management Department. We were told by
those who scripted the paradigm shift that Human Capital is to be considered more
important than Financial Capital and hence there is greater need to focus on molding
Human Resources to take on the future of the Institution. Willingly or otherwise the
Management kept engaging the unions / associations, duly recognizing them as
representatives of various segments of the Human Resources - Workforce, on all
matters including the health of the Institution.
HRM is responsible for framing policies that would provide right environment for the
Work force to play their role and contribute their best in achieving the Goal set by
corporate. HRM is responsible for maintaining harmony in the Industrial Relations Front.
Sound HR Policies can alone serve as motivation and morale booster to the workforce.
Similarly harmonious climate in the bank can only contribute to the Positive mindset to
the workforce. In both the fronts the role of Management and the representative unions
must be on the same page.
But what we are witnessing in the recent past is that Administration in our Bank has
chosen to adopt indifferent approach towards unions and as a result the entire
atmosphere is vitiated. When the representative unions are aggrieved or treated with
attitude of neglect what kind of message goes down to the work force? Even if the
Unions are looked at with discomfort and unwanted, at-least the Management should
remain responsive to the grievances of the employees and address them in time. HRM is
not comfortable if employees or their state units conveying their grievances directly.
HRM is equally not responsive when the issues are taken up by the Apex body. What
else is the mechanism available for the employees to get their grievances redressed?
How aggrieved employees can be expected to get motivated to give their best for the
growth of the Institution?
It is also worth to quote the under mentioned clauses from the IR policy - approved by
the Board on 26/2/2013 and circulated vide communication CHO/PAS/01/2013-14 DT.
22/04/2013.
PARA 1.2 : Only a responsive human resource management is the key to a healthy and
robust organisation, the Management has to have in place a mechanism for taking timely
decisions representative of the expectations of the majority of its workman employees.
This is all the more necessary in the present competitive environment when the Bank is
required to continuously upgrade and fine tune it's working to maintain edge over others.
Para 2.1: in the dynamic Miley in which the Bank operates, managing harmonious human
relations is imperative for ensuring steady business growth in order that the
Management is able to continuously keep itself abreast of the expectations and
aspirations of the human resource, it is necessary that a structure of Industrial Relation
is put in place to streamline various aspects of human relations. As it makes eminent
sense to heed the majority sentiment of the workforce of workman employees, the Bank
is putting in place mechanism as a tool to promote self-reliance, mutual goodwill, trust,
confidence and cooperation for achieving Bank's mission.
Para 5.5: The Management will not enter into correspondence with the union at the
branch level. The correspondence emanating from President/ General Secretaries at the
state Units will be given cognizance by Zonal Heads and communications emanating
from Central units will only be responded by Head office.
Thus we find that HRM is found wanting in fulfillment of the objectives of the above
policy.
As a responsible trade union, we have resisted our temptation of placing any demand
that would financially burden the Bank at this hour of crises. All the issues that have
been starving for solution are well within the ambit of the existing policies like
promotions, transfer, corrections of wrongs, mitigation of hardship faced by the
employees, attitude related, payments due as per law etc. All that we insist is that timely
action on the issues dealt in the forums like GR Committee. We are unable to understand
and appreciate what is holding the Department in taking timely actions?
We shall be thankful if the under mentioned questions agitating our mind are answered.
Why Substaff promotions are held up even after a lapse of one year since release of
Scale -1 promotions?
Why graduate Substaff promotions are withheld much against the provisions - 4.6 of
PPA 2012, as per which promotions should have to be twice in a year without having to
wait for declaration of vacancies?
Why the Management is reluctant to advise the Zones for filling the vacancies of
Daftaries by making eligible the House Keeper cum Peons as per agreement dt 6
th
July
2015?
Why the management is reluctant to advise some zones to notify the existing vacancies
of Special Assistants and Head Cashiers?
Why the Management is unable to honor its commitment to amend the PPA for
according recognition to the Army Graduate Certificate?
What reservation the Management has, in revising the cost of uniform which was last
revised in 2012, knowing well the cost of material and labour had gone up in the last 6/7
years?
What are the factors contributing to the inability of Management to consider the
employees recruited after 1/11/1993 as Pension Optees when the settlement is clear
that those joined the Bank on or after 1/11/1993 are deemed Optees?
What are the compulsions in not taking steps to advise the Zones indulging in violations
of clause 9.6 of PPA (SHIMLA), Request Transfer Policy (Bhopal) Ho's instructions with
regard to postings of new recruits - request transfers to get precedence (Jaipur)?
What are the problems coming in the way to clarify to zones reiterating clause 5.6.8 of
PPA, 2012 with regard to uniform effective date for those selected for functional
allowance posts?
What are the reasons to deny bonus to Daily Wagers when Bonus Act provides for it and
all other Banks having complied with it?
What are the hurdles in granting fair wages to Daily wagers & Canteen Boys under
minimum wages act?
How the Management proposes to address the concerns of the branches which are
reeling under severe shortage of clerical and substaff as a result complaints of
excessive work including supervisory in nature are forced upon the clerical staff, non
sanction of leave, harassment of staff, intimidatory attitude of branch heads etc are
pouring in besides hampering customer service and growth?
How compassion can be shown if the employment is denied to sons or daughters of the
deceased by insisting only spouse should apply?
Why the human element is absent in the matter of considering request transfers,
particularly those involving Interstate and are undergoing trauma due to health issues,
spouse joining, health issues of near and dear etc?
Why the HO should remain muted on the complaint of women employees being posted
in remote branches which are not even provided with basic amenities like wash rooms
etc?
Why HRM is reluctant to take on the Erring Zonal Heads whose attitude and approach
trigger unrest in the IR front?
Why the Staff welfare Committee is not called as per it's own decision for convening
meetings well before the end of FY for reviewing the implementation of various schemes
and expenditure incurred?
Why there is sudden halt to Apex Level Performance Review Committee meetings when
there is a call for ONE TEAM, ONE DREAM?
What are the views of HRM with regard to our Observations on introduction of Biometric
Attendance?
What has come in the way in taking follow up measures to the discussions held in the
Policy Committee meeting held in October, 2018?
Why many Zonal Heads are refusing to hold periodical IR meetings?
Above all what are the compelling reasons for widening gap between the Administration
and the Representatives / Representative unions and how the Bank views the
deteriorating situation in the IR front?
We hope and trust that this communication will be taken in the right spirit and our
anxiety and concerns are well understood besides treating this as the one reflecting the
ground level situation. We are equally hopeful that HRM will do well by finding ways and
means to correct the situation and prove worthy of its existence.",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1548288000000",
            "url": null
        },
{
            "id": 6,
            "name": "HumanChain before HO and ZO Grand Success today",
            "image": "https://aiucbef.com/appnews/images/humanchain.jpg",
            "status": "We are overwhelmed by the enthusiastic and spirited response shown to the call of our
Federation. Badge wearing programme on 10 th was carried out by all our units in a
magnificent manner. Today's programme of HUMAN CHAIN before select Zonal offices has
set a new record in the annals of our Federation. In fact we gave this call only to limited
centres. But the call has been observed in almost all centres with tremendous amount of
zeal and enthusiasm. All our units and members made it to happen beyond our expectations.
Congratulations and salutes to you and to all our Members. Words are not adequate to place
on record of our deep sense of appreciation to the leadership of our units. Similarly
participation of our Members,particularly the new generation comrades is praise worthy and
add strength to our confidence. Keep up the spirit.
Our next programme is on 24 th :Dharna before all Zonal Offices and Head
Office.
We are sure that by now our units have made all preparations for holding DHARNA before
Nodal Zonal offices.
Those who will be participating in the Dharna be advised to apply leave in time stating the
reason as their participation in Dharna as per the call of All India Uco Bank Employees
Federation. Such participants may be told that it will be on loss of pay.
Let the Dharna be conducted in a disciplined manner between 9.30 AM to 5.30 PM which will
be followed by massive demonstration by mobilizing members.
Let us confine our slogans what ever is said in the placards. It is desired to avoid giving 
negative slogans or abusive slogans. No use of names of any individual in the slogans.
Units also can have a deputation of their Officebearers to respective ZM s in the evening at
the end of Dharna and convey our concern over the approach of HRM in HO.
In sum and substance the programme should have desired effect on the Management and be
yet another event that adds to the REPUTATION of AIUCBEF.
MARCH AHEAD WITH COURAGE, CONFIDENCE AND COMMITMENT." ,
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1537161764000" ,
            "url": null
        },
      {
                  "id": 6,
                  "name": "DECISIONS OF WORKING COMMITTEE MEETING - ACTION PROGRAMMES",
                  "image": "https://aiucbef.com/appnews/images/informalcv.jpg",
                  "status": "We trust that our earlier circular dated 25th August is received by our units and units have taken necessary steps to communicate the same to our rank and file to prepare them. We now give under the details for immediate compliance of our units. 
1. OBSERVANCE OF PROTEST & DEMANDS DAY WITH BADGE WEARING BY ALL OUR MEMBERS. ON MONDAY THE 10 TH SEPTEMBER. 
Note : Units will print the badge as above and ensure despatch to branch units, so as to reach branch units before 8 th September. 
2. OBSERVE HUMAN CHAIN BEFORE ZONAL OFFICES WHERE UNITS ARE IN A POSITION TO MOBILISE MINIMUM 10 MEMBERS TO STAND BEFORE THE ENTRANCE OF ZONAL OFFICE IN A ROW OR TWO HOLDING PLAN CARDS BETWEEN 9.15 AM AND 9.50 AM ON MONDAY THE 17 TH SEPTEMBER. 
Slogans for Placards will be sent shortly.The same day evening AT 5.30 PM, there can be DEMONSTRATION before all Zonal offices. - SLOGANS WILL BE SENT SHORTLY 
3. PREPARE THE UNIT FOR DHARNA PROGRAMME ON 24 TH SEPTEMBER. DHARNA WILL BE HELD BEFORE NODAL ZONAL OFFICES. OFFICE-BEARERS, COMMITTEE MEMBERS OTHER INTERESTED ACTIVISTS WILL FORM PART OF THE DHARNA. TIMING : 9.30 AM to 5 pm which will be followed by Demonstration by mobilising local members. Units are advised to issue proper communication to their branch units and ensure all members are made aware of the programmes. 
We remain confident that this time too our units and members would make the struggle to set yet another milestone in our journey." ,
                  "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
                  "timeStamp": "1535421229000" ,
                  "url": null
              },

{
            "id": 6,
            "name": "Rededication week Dec 18-22 Starts today",
            "image": "https://aiucbef.com/appnews/images/reded.jpg",
            "status": "UFUBU REDEDICATION WEEK 18 to 22  Dec.2017
Campaign begins to day
Canvass CASA Accounts
Retail Loan Products
Recover NPAs
Let us prove that UFUBU can
DO IT" ,
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1513568451000" ,
            "url": null
        },
        {
            "id": 6,
            "name": "15th Triennial Conference of our Federation - Citcular",
            "image": null ,
            "status": "15th Triennial Conference of our Federation, held at Hyderabad on 10 th,11th and 12th September,2017 was a grand Success.
Highlights of the conference:
• Attended by 900 comrades from all over India ,
•Around 100 woman comrades among them, 
•Around 450 comrades from the younger generation,
•Inauguration by General Secretary of Communist Party of India,
•Addressed by Managing Director and CEO of our Bank,
•Keynote address by General Secretary of AIBEA,
•Greeted by Executive Director of our Bank
•Special session for Youth,
•Special session on Medical Insurance Scheme by HeritageHealth TPA,
•56 comrades participated in Deliberations 
•All sessions dot on Time, 
•Praise worthy arrangements by Hostunit
Inaugural & Public Session of the Conference commenced with hoisting of AIBEA flag dot at 3.30pm on10th by Com.C.H.Venkatachalam, GeneralSecretary of AIBEA amidst thunderous slogans of AIBEA ZINDABAD, AIUCBEF ZINDABAD renting the air.
Sharpat4.05PM thesessionbeganwithawelcomeSongandlightingoflamp. Com.Rambabu,ChairmanoftheReceptionCommiteewelcomedthegathering.
Com.K.VijhayanPresidentofAIUCBEFthendeliveredhisspeechexplainingthesituationin whichthe15THTriennialconferenceismeeting.
Com.S.SudhakarReddy,GeneralSecretaryofCPI,inhisinspiringInauguralAddressspoke atlengthontheglobalsituationthathadimpactonIndiaanditspeople,Hewascriticalof thepoliciesbeingpursuedbytheGovernmentatthecentreagainstthecommonpeopleand workingclass.Condemningthepoliciesthatareaimedat,todestroythePublicSector institutions,hecomplimentedthe
Bank em ployees under the banner of AIBEA, for their relentless struggle against privatizationofPublicsectorbanks.HeexpressedconfidencethatAIUCBEFwill continuetobeintheforefrontofalstrugglescaledbyAIBEAandthejointforum ofCentral TradeUnions.
Shri.R.K.Takkar,MD&CEOofourBank,theChiefGuestintheConference,whilethanking ourFederationforgivingthisopportunitytospeaktosuchavastgathering,explainedthe chalengesbeforetheBankanditsworkforce,inthebackgroundofinvocationofPCAand signingofMOU.WhilesoundingaoptimisticnoteonrevivalofBank‘shealth,heassured thatthereisnothreatofMergerandevenifitbecomesinevitablewewouldmakeourBank aACQUIRINGBankamidstthunderousapplausefrom theparticipants.
Com.C.H.Venkatachalam inhisusualinimitablestylespokeatlengthastohow thebulging NonPerformingAssetsandthelackofinadequatestepsfrom theGovernmentforrecovery h a v e a m e n a c in g e f fe c t o n th e B a n k ’s b a la n c e s h e e ts . D e m a n d in g o f th e G o v e rn m e n t stringentstepstorecoverpeople’smoneyfrom thecorporatedefaulters,hewarnedthat stepstowardsconsolidationwouldfurthercompoundtheproblemsoftheBanks.Speaking on11thbipartitewagetalks,heexpressedconfidencethatthenegotiatingteam ofIBA, beingheadedbynoneotherthanShri.R.K.Takkar,MD&CEOofUCOBankwouldadopta fairandreasonableapproachandariveatasatisfactorysetlementbeforetheexpiryofthe curentsetlement.HecomplimentedAIUCBEFforitsroleinchampioningthecauseofUCO comradesandinalthestrugglescaledbyAIBEAandUFBU.
Com.AjayRouterey,GeneralSecretaryofAlIndiaFederationofUCOBankOficers(AIBOA) greetedthemembersandurgedupontheFederationtotakemorestepstostrengthen AIFUBO.
Shri.D.Sharma,ZonalHeadofHyderabadZonegreetedtheconference.
Aspartofourinvolvementinthesocialcauseandtomarktheoccasionof15thTriennial Conference,anamountof21,000wasdonatedto HOMEOFDISABLEDaNGOtakingcare ofnearly400physicalyandmentalychalengedpeople.Thechequewasdeliveredtothe authoritiesbyCom.C.H.V.&ourMD.
Com.C.M.Patel,GeneralSecretaryofourFederationdeliveredvoteofthanks.
Folowed by this,a culturalentertainmentprogramme show cased to entertain the participants.BharataNatyam danceperformedbydaughtersofourcomradeswasthe highlightoftheprogramme.
ThustheGrandInauguralSessioncametoanendat9.30pm asscheduled.
Thekindofdiscipline,thekindofcooperation,thekindofatentiveness,displayedbyour comradesdeservesalpraise.
",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1505268545000",
            "url": null
        },


{
            "id": 32,
            "name": "Our Action Programs",
            "image": null,
            "status": "A meeting of our office bearers, WC members, functionaries of units , who were present in Chennai in connection with 28th  NATIONAL CONFERENCE OF AIBEA was held on 10th January. Both the President and the General Secretary placed before the members, developments concerning the bank and pending issues. The meeting took stock of the situation arising out of under mentioned programmes carried out by the units at the call of Federation.

Signature campaign - letter sent to MD and consequent response from the management.
Submission of letters to branch managers demanding payment of over time for the actual hours of work performed during the period of Demonetisation.
It was observed that on the issue of OVER TIME some of the units have not organised it as called upon by the Federation. ALL UNITS SHOULD ENSURE COMPLETION OF THE PROGRAMME - THAT IS SUBMISSION OF INDIVIDUAL LETTER IN THE FORMAT GIVEN BY FEDERATION POSITIVELY BEFORE 25 th JANUARY.

Further, it was noted that after our signature campaign ....
Management came forward to implement staff welfare measures,
A committee was formed to screen VRS requests and some among them are considered, though it is not to our satisfaction
Compassionate appointments  are yet to be considered
Management remains silent on Over time issue
Similarly no response to our demand for holding policy committee meeting to discuss certain important pending policy matters,
Unfriendly Attitude of HRM department towards various matters raised by us,
Non implementation of understandings reached in various meetings between the management and the Federation.

As part of our ongoing movement against the above said attitude of the Management, it has been decided to unleash the following programmes.

Units which are yet to organise SUBMISSION OF INDIVIDUAL LETTER DEMANDING OVER TIME TO BRANCH HEADS IN THE PRESCRIBED FORMAT SHOULD COMPLETE THE SAME AND CONFIRM COMPLIANCE BY 25 th January.
Office bearers and Committee members stationed in the location of circle offices shall meet the circle heads in a deputation and submit a memorandum ( specimen encoded) on our demands,  seeking his support by talking up with HO HRM. This will be carried out on a uniform date - 31/1/2017
Dharna before all Zonal offices on dates as prescribed in the enclosure.
DHARNA BEFORE HEAD OFFICE FIRST WEEK OF MARCH ( date will be decided after confirming working committee arrangements with Uco Bank Staff union, Kolkata)
Working committee will meet a day after Dharna at Kolkata and decide further programmes and the date for All India strike.
6.  No member shall accept to work over time unless it is requested in writing by the branch manager on and from 1st February 2017 . Units shall give a letter to this effect to respective zonal heads on 30 th January.

In the mean while we have addressed a letter to GM HRM about our views and suggestions on the HEALTH OF THE BANK WHICH MAY BE CIRCULATED WIDELY AMONG ALL THE BRANCHES & STAFF

Comrades, we have no option except to go all out to make our existence meaningful. Management  is increasingly becoming casual towards unions and the interest of work force. Our concern for the bank too is responded in a less than serious manner. We have to do justice as a responsible trader union. Let us, mindless of the cost and consequences, march ahead to do that. Go ahead with courage, conviction, commitment and confidence.

Implement all programmes in letter and spirit. Inform Federation from time to time about the success of your efforts in implementing the programmes in total. ",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1480731951000",
            "url": null
        },
{
            "id": 32,
            "name": "NEWS UPDATE",
            "image": null,
            "status": "AIUCBEF  launches mass signature compaign from employees to MD both on the steps needed for Improving Bank's performance and on Attitude of Top Management towards the matters pertaining to work force.",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1480731951000",
            "url": null
        },

{
            "id": 34,
            "name": "NEWS UPDATE:STAFF WELFARE MEETING ON 19TH OCTOBER",
            "image": null,
            "status": "Members are aware that consequent to our me memorandum to Managing Director followed by other demonstrative programmes, Management in a meeting held last month assured to call for the Staff welfare committee meeting for finalising / renewing the staff welfare measures.Much delayed Staff welfare meeting was held on 19TH Oct. 2016 at our Head Office. Undersigned participated in the said meeting on behalf of our Federation. From Management side both the EDs, GM HRM, GM Finance, DGM PSD, AGM PSD, and their team participated in the meeting.Meeting started with a brief welcome address by GM HRM. While replying from the unions side we expressed our deep resentment over undue delay in conveying this meeting.However we also thanked the management for providing Rs. 10 crores towards staff welfare scheme in spite of the fact that Bank has incurred loss for the relevant financial year.Apportionment of fund of 10 crores (last years allotment was 20 crores) was taken up for discussion for the existing and retired employees.From our union’s side we have tried successfully to continue all the Welfare schemes except the one which have become irrelevant-cost of books for Part-time employees, as there are no part-time employees in the Bank now.Moreover we have some unspent amount of staff welfare fund too. We have pleaded to the Management to rope in that fund too while apportioning the actual provisional amount in various staff welfare schemes.HOWEVER THE FINAL CALL IN THIS MATTER HAS TO BE TAKEN BY M. D. & CEO. SINCE M.D. & CEO WAS IN THE MEETING (AS HE WAS OUT OF STATION) CONCLUSIVE DECISION COULD NOT BE TAKEN.I am sure that comrades will appreciate that the total fund available is half of the previous year, in spite of the fact that our Bank incurred huge loss. Let me refresh your memory that the lead to make at least some provision for staff welfare scheme was taken by us, despite red Balance sheet. Moreover, just like in previous years, mandatorily, apportionment has to be made for retired employees too.We are confident that we will be able to continue with all the schemes as mentioned above with a marginal reduction on one/two schemes.Retired employees will be provided with some subsidy which will be comparable considering the financial resource of staff welfare fund and the bank for their health insurance scheme besides their scheme of Funeral expenses.We have also pleaded emphatically with the Management to provide soft loan for subscribing to Health Insurance scheme, in light of steep hike in premium. Management too agreed for the same.We are unable to quantify the exact amount, unless the decision regarding unspent amount is taken. Rest assured we trying our best, and in case of favorable decision regarding roping in of unspent amount is forthcoming, the reduction in the scheme will a very small one besides retired employees getting reasonable subsidy for health insurance. As,in the absence of MD and his approval, we have thought it fit to hold back the communication though some other unions have circulated  the details of deliberations of the meeting. Hope our comrade will appreciate.",
            "profilePic": "https://aibea.in/upload/mdnews/aibea.png",
            "timeStamp": "1476927673000",
            "url": null
        }




    ]
}
