[{"id":993,"name":"Work shop on defence  organised in Hyderabad by AIUCBEF","image":"http://aibea.in/upload/mdnews/aibea.png","status":"<p>Work shop on defence  organised in Hyderabad by AIUCBEF on 28th and 29th Nov  was most successful with participation of 35 comrades from different state units.  All round appreciation from the participants.<\/p>"},
{"id":994,"name":"Canteen subsidy and other staff welfare measures restored with the pressure built up by aiucbef.","image":"http://aibea.in/upload/mdnews/aibea.png","status":"<p>Canteen subsidy and other staff welfare measures restored with the pressure built up by aiucbef.<\/p>"},
{"id":995,"name":"AIUCBEF  launches mass signature compaign from employees to MD","image":"http://aibea.in/upload/mdnews/aibea.png","status":"<p>AIUCBEF  launches mass signature compaign from employees to MD both on the steps needed for Improving Bank's performance and on Attitude of Top Management towards the matters pertaining to work force.<\/p>"},
{"id":996,"name":"STAFF WELFARE MEETING ON 19TH OCTOBER","image":"http://aibea.in/upload/mdnews/aibea.png","status":"<p>Members are aware that consequent to our me memorandum to Managing Director followed by other demonstrative programmes, Management in a meeting held last month assured to call for the Staff welfare committee meeting for finalising or renewing the staff welfare measures.Much delayed Staff welfare meeting was held on 19TH Oct. 2016 at our Head Office. Undersigned participated in the said meeting on behalf of our Federation. From Management side both the EDs, GM HRM, GM Finance, DGM PSD, AGM PSD, and their team participated in the meeting.Meeting started with a brief welcome address by GM HRM. While replying from the unions side we expressed our deep resentment over undue delay in conveying this meeting.However we also thanked the management for providing Rs. 10 crores towards staff welfare scheme in spite of the fact that Bank has incurred loss for the relevant financial year.Apportionment of fund of 10 crores (last years allotment was 20 crores) was taken up for discussion for the existing and retired employees.From our union’s side we have tried successfully to continue all the Welfare schemes except the one which have become irrelevant-cost of books for Part-time employees, as there are no part-time employees in the Bank now.Moreover we have some unspent amount of staff welfare fund too. We have pleaded to the Management to rope in that fund too while apportioning the actual provisional amount in various staff welfare schemes.HOWEVER THE FINAL CALL IN THIS MATEER HAS TO BE TAKEN BY M. D. & CEO. SINCE M.D. & CEO WAS IN THE MEETING (AS HE WAS OUT OF STATION) CONCLUSIVE DECISION COULD NOT BE TAKEN.I am sure that comrades will appreciate that the total fund available is half of the previous year, in spite of the fact that our Bank incurred huge loss. Let me refresh your memory that the lead to make at least some provision for staff welfare scheme was taken by us, despite red Balance sheet. Moreover, just like in previous years, mandatorily, apportionment has to be made for retired employees too.We are confident that we will be able to continue with all the schemes as mentioned above with a marginal reduction on one/two schemes.Retired employees will be provided with some subsidy which will be comparable considering the financial resource of staff welfare fund and the bank for their health insurance scheme besides their scheme of Funeral expenses.We have also pleaded emphatically with the Management to provide soft loan for subscribing to Health Insurance scheme, in light of steep hike in premium. Management too agreed for the same.We are unable to quantify the exact amount, unless the decision regarding unspent amount is taken. Rest assured we trying our best, and in case of favorable decision regarding roping in of unspent amount is forthcoming, the reduction in the scheme will a very small one besides retired employees getting reasonable subsidy for health insurance. As,in the absence of MD and his approval, we have thought it fit to hold back the communication though some other unions have circulated  the details of deliberations of the meeting. Hope our comrade will appreciate.<\/p>"},{"id":997,"name":"Brief on Today discussions held with MD, EDs and HRM","image":"http://aiucbef.com/appnews/images/23aug16grmeet.jpeg","status":"<p>Positive on ......Release of compassionate appointments,Consideration of VRS requests on medical grounds,Staff welfare measures- meeting will be scheduled before middle of September,Declaration of SUBSTAFF promotions,Holding of separate meeting on our demands on policy related matters by September,Holding  of Apex level Performance Review committee in September,Several other matters pertaining to individual GRIEVANCES, etc,Efforts to address our concern on HOSPITALISATION BILLS - will be taken up with Heritage TPA,Release of MILE STONE AWARD pending from 2013...Non committal..On more recruitment,Petrol Reimbursement scheme and Daily wagers - till Bank comes back to profit.Detailed circular follows.<\/p>"},{"id":998,"name":"Demonstration at the HO gate before Board meeting","image":"http://aiucbef.com/appnews/images/hodharna.jpg","status":"<p>Demonstration at the HO gate before Board meeting commences. MD ED Executives board member has seen while entering.<\/p>"},{"id":999,"name":"Joint conference of Both workman and officers- Andra Pradesh and Telangana Unit","image":"http://aiucbef.com/appnews/images/apunit6.jpg","status":"<p>Joint conference of Both workman and officers- Andra Pradesh and Telangana Unit took place on 23-7-16. Com. Prakash Rao as President,com.Jagdeesh Babu as general secretary, young Com.vivekanandha Reddy as Deputy Gen Secretary,Sreenivas Treasurer elected in the conference. <\/p>"}]